Solution solution = new Solution();
int[] test1 = { 1, 2, 3, 4, 5, 6, 7 };
solution.Rotate(test1, 3);

public class Solution
{
    public void Rotate(int[] nums, int k)
    {
        int length = nums.Length;
        k = k % length;

        int[] rotated = new int[length];

        for(int i = 0; i < length; i++)
        {
            rotated[(i + k) % length] = nums[i];
        }
        
        for(int i = 0; i < length; i++)
        {
            nums[i] = rotated[i];
        }
        /*
        
        এখন দেখি লুপটি কীভাবে কাজ করে:

        i	nums[i]     (i + k) % length	rotated-এ মান বসে	        মন্তব্য
        --------------------------------------------------------------------------------
        0	1	        (0+3)%7 = 3	        rotated[3] = 1	    1 যাবে ইনডেক্স 3-এ
        --------------------------------------------------------------------------------
        1	2	        (1+3)%7 = 4	        rotated[4] = 2	    2 যাবে ইনডেক্স 4-এ
        --------------------------------------------------------------------------------
        2	3	        (2+3)%7 = 5	        rotated[5] = 3	    3 যাবে ইনডেক্স 5-এ
        --------------------------------------------------------------------------------
        3	4	        (3+3)%7 = 6	        rotated[6] = 4	    4 যাবে ইনডেক্স 6-এ
        --------------------------------------------------------------------------------
        4	5	        (4+3)%7 = 0	        rotated[0] = 5	    5 যাবে ইনডেক্স 0-এ
        --------------------------------------------------------------------------------
        5	6	        (5+3)%7 = 1	        rotated[1] = 6	    6 যাবে ইনডেক্স 1-এ
        --------------------------------------------------------------------------------
        6	7	        (6+3)%7 = 2	        rotated[2] = 7	    7 যাবে ইনডেক্স 2-এ
        --------------------------------------------------------------------------------

        */
    }
}